
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x81c: file p3final.c, line 17.
(gdb) r
Starting program: /home/runner/pps-test1-sanjanaraghupathi-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3final.c:17
17  int main(){
(gdb) s
19    input(&a,&b);
(gdb) n
first number:
5
second number:
7
20    add(a,b,&sum);
(gdb) s
add (a=5, b=7, sum=0x7ffcf62c7444) at p3final.c:11
11    *sum =a+b;
(gdb) p a
$1 = 5
(gdb) p b
$2 = 7
(gdb) n
12  }
(gdb) n
main () at p3final.c:21
21    output(a,b,sum);
(gdb) n
the sum of 5 and 7 is 12
22    return 0;
(gdb) p sum
$3 = 12
(gdb) n
24  }(gdb) q
A debugging session is active.

    Inferior 1 [process 33] will be killed.

Quit anyway? (y or n) y